@echo off
chcp 65001 > nul
echo ===================================================
echo   Сброс окружения песочницы ZEMI
echo ===================================================

if exist ".venv" (
    echo Удаление папки .venv...
    rmdir /s /q .venv
    echo [OK] Виртуальное окружение полностью удалено.
) else (
    echo [!] Папка .venv не найдена.
)

if exist "uv.exe" (
    echo Удаление бинарника uv.exe...
    del /f /q uv.exe
)

echo ===================================================
echo   Откат завершен! Система готова к чистой сборке.
echo ===================================================
pause